CF/ExchangePlans/ОбменРозницаУправлениеТорговлей103.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ExchangePlan>
		<Properties>
			<Name>ОбменРозницаУправлениеТорговлей103</Name>
			<Comment>Синхронизация данных между конфигурациями "Розница", редакция 2.1 и "Управление торговлей", редакция 10.3</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыгружатьСерииНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

CF/ExchangePlans/ОбменРозницаУправлениеТорговлей103/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ИспользоватьОтборПоОрганизациям Тогда
		Организации.Очистить();
	КонецЕсли;
	Если НЕ ИспользоватьОтборПоСкладам Тогда
		Склады.Очистить();
	КонецЕсли;
	РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;

	Если ЭтоНовый() Тогда
		Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Истина);
	Иначе
		Если ПометкаУдаления Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	УзлыОбмена.Ссылка
			|ИЗ
			|	ПланОбмена.ОбменРозницаУправлениеТорговлей103 КАК УзлыОбмена
			|ГДЕ
			|	УзлыОбмена.Ссылка <> &ЭтотУзел
			|	И УзлыОбмена.Ссылка <> &Ссылка
			|	И (НЕ УзлыОбмена.ПометкаУдаления)");
			Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменРозницаУправлениеТорговлей103.ЭтотУзел());
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Ложь);
			КонецЕсли;
		Иначе
			Если НЕ Константы.ИспользуетсяОбменСУправлениемТорговлей.Получить() Тогда
				Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьОбъект(ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПередУдалением".
//
Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	УзлыОбмена.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменРозницаУправлениеТорговлей103 КАК УзлыОбмена
	|ГДЕ
	|	УзлыОбмена.Ссылка <> &ЭтотУзел
	|	И УзлыОбмена.Ссылка <> &Ссылка
	|	И (НЕ УзлыОбмена.ПометкаУдаления)");
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.ОбменРозницаУправлениеТорговлей103.ЭтотУзел());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Константы.ИспользуетсяОбменСУправлениемТорговлей.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОбъект(ДанныеЗаполнения)
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаВыгрузкиДокументов	= НачалоГода(ТекущаяДатаСеанса());
	РежимВыгрузкиПриНеобходимости 	= Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
